# TODO: remove this testing stubs
ONGOINGS_MOCK = ['У моей жены нет эмоций 6 (Субтитры)', 'Цикл историй: Межсезонье и сезон монстров 5 (Субтитры)',
                 'Псевдогарем 5 (AniLibria)', 'От простого человека до героя-разведчика 6 (Субтитры)',
                 'Магическая ремесленница Далия не унывает! 5 (AniStar, AnimeVost, Субтитры)',
                 'Соблазн 2,5-мерного измерения 5 (AniLibria, AniStar, AnimeVost)',
                 'Пока-пока, Земля 4 (JAM CLUB, Dream Cast, AniStar, Субтитры, AnimeVost)',
                 'Моя геройская академия 7 12 (AniStar, AnimeVost, JAM CLUB, Субтитры)',
                 'Терраса кафе богинь 2 5 (AniLibria)',
                 'Я парировал всё время, чтобы стать сильнейшим авантюристом 5 (AniLibria, JAM CLUB, Dream Cast)',
                 'Цикл историй: Межсезонье и сезон монстров 4 (Студийная Банда)', 'Звёздное дитя 2 4 (AniRise)',
                 'Этот мир слишком несовершенен 5 (AniStar)',
                 'Ниер: Автомата — Версия 1.1а. Часть 2 5 (AniDUB, AniStar, Dream Cast, AnimeVost, Субтитры)',
                 'Отряд самоубийц из другого мира 7 (JAM CLUB)',
                 'О моём перерождении в слизь 3 17 (AniDUB, AnimeVost, Субтитры)',
                 'Код Гиас: Вернувшийся Розе 7 (AniLibria)', 'Моя подруга-олениха, Нокотан 5 (AniDub Online)',
                 'Я стал самым сильным с провальным навыком «ненормальное состояние», я разрушу всё 5 (AniLibria)',
                 'Грендайзер U 5 (AniStar)', 'Рамэнная рыжего кота 4 (JAM CLUB)', 'Моя сэмпай — парень? 5 (AnimeVost)',
                 'Волчица и пряности: Торговец встречает мудрую волчицу 17 (AniRise)', 'Аватар короля 3 11 (AniStar)',
                 'Атри: Мои дорогие моменты 3 (Студийная Банда)',
                 'Невероятный новичок средних лет, прошедший тренировки на грани смерти 5 (TVShows)']

SEARCH_RESULT_MOCK = ['Штурмовые ведьмы: Дорога на Берлин', 'Ямада и семь ведьм', 'Академия ведьмочек',
                      'Изетта, последняя ведьма', 'Штурмовые ведьмы OVA', 'Ведьма и чудовище', 'Мэри и ведьмин цветок',
                      'Храбрые ведьмы: Эпизод 13', 'Штурмовые ведьмы', 'Штурмовые ведьмы',
                      'Божества Идатэн в мирном поколении', 'Дореми: В поисках волшебства', 'Восхождение чародея',
                      'Сияющие ведьмы', 'Мобильный воин Гандам: Ведьма с Меркурия — Пролог',
                      'Мобильный воин Гандам: Ведьма с Меркурия', 'Берсерк 3: Воспоминания ведьмы',
                      'Академия ведьмочек']

ANIME_RESULT_MOCK_TITLE = 'Штурмовые ведьмы: Дорога на Берлин'
ANIME_DESCR_MOCK = 'Когда на мир напали загадочные пришельцы «неврои», государства всего мира заключили союз. Лишь девушки, наделённые особой волшебной силой, были способны дать отпор беспощадному врагу… Теперь Союзные войска готовят операцию по возвращению Берлина, для чего было решено вновь созвать 501-е сводное истребительное крыло «Штурмовые ведьмы». Вместе с Хаттори Сидзукой, пополнившей состав крыла, девушкам вновь предстоит дать бой невроям. Смогут ли они освободить берлинское небо?'
EPISODES_MOCK = ['The Magical Girl of the Alps 1', 'The Strike Witches Come Together 2', 'What the Two of Us Can Do 3',
                 'Beyond Two Hundred Miles Per Hour 4', 'Queen of Nederland 5', 'Hounds of Vengeance 6',
                 'They Go Boing-Boing 7', 'The Fog 8', "Mina's Sky 9", 'Shizuka, Come In! 10', 'Road to Berlin 11',
                 'I Still Want to Protect 12']

